CSI API ETABS v1

# cPierLabel Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cPierLabel

    Public Interface cPierLabel

    Dim instance As cPierLabel

    public interface class cPierLabel

    type cPierLabel =  interface end

The cPierLabel type exposes the following members.

Methods

| Name| Description
---|---|---
|
ChangeName|  Changes the name of a
defined Pier Label
|
Delete|  Deletes the specified
Pier Label
|
GetNameList|  Retrieves the names
of all defined Pier Labels
|
GetPier|  Checks whether the
specified Pier Label exists
|
GetSectionProperties|  Retrieves
the section properties for a specified pier.
|
SetPier|  Adds a new Pier Label
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com